ovidiiu/edgetx_stm32f405RGT6/radio/src/targets/taranis/board.cpp
/*
 * Copyright (C) EdgeTX
 *
 * Based on code named
 *   opentx - https://github.com/opentx/opentx
 *   th9x - http://code.google.com/p/th9x
 *   er9x - http://code.google.com/p/er9x
 *   gruvin9x - http://code.google.com/p/gruvin9x
 *
 * License GPLv2: http://www.gnu.org/licenses/gpl-2.0.html
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */

#include "stm32_hal_ll.h"
#include "stm32_gpio.h"

#include "hal/adc_driver.h"
#include "hal/trainer_driver.h"
#include "hal/switch_driver.h"
#include "hal/module_port.h"
#include "hal/abnormal_reboot.h"
#include "hal/rotary_encoder.h"
#include "hal/usb_driver.h"
#include "hal/gpio.h"
#include "hal/rgbleds.h"

#include "board.h"
#include "boards/generic_stm32/module_ports.h"
#include "boards/generic_stm32/intmodule_heartbeat.h"
#include "boards/generic_stm32/analog_inputs.h"
#include "boards/generic_stm32/rgb_leds.h"

#include "debug.h"
#include "rtc.h"

#include "timers_driver.h"
#include "dataconstants.h"
#include "trainer.h"

#if defined(FLYSKY_GIMBAL)
  #include "flysky_gimbal_driver.h"
#endif

#if defined(BOOT)

#if defined(BLUETOOTH)
void boardBLEarlyInit()
{
  // Disable the BT module so it will be detected on firmware start
#if defined(BT_EN_GPIO)
  gpio_init(BT_EN_GPIO, GPIO_OUT, GPIO_PIN_SPEED_LOW);
  gpio_write(BT_EN_GPIO, 1);
#endif
}
#endif

#if defined(ROTARY_ENCODER_NAVIGATION)
void boardBLInit()
{
  rotaryEncoderInit();
}
#endif

#endif // BOOT

#if !defined(BOOT)
  #include "edgetx.h"
  #if defined(PXX1)
    #include "pulses/pxx1.h"
  #endif
#endif

#if defined(BLUETOOTH)
  #include "bluetooth_driver.h"
#endif

#if defined(CSD203_SENSOR)
  #include "csd203_sensor.h"
#endif

HardwareOptions hardwareOptions;

#if !defined(BOOT)

#if defined(FUNCTION_SWITCHES)
#include "storage/storage.h"
#endif

#if defined(SALED_PWR_GPIO)
void SALEDpwrInit()
{
  gpio_init(SALED_PWR_GPIO, GPIO_OUT, GPIO_PIN_SPEED_LOW);
  SALED_PWR_ON();
}
#endif
#if defined(SDLED_PWR_GPIO)
void SDLEDpwrInit()
{
  gpio_init(SDLED_PWR_GPIO, GPIO_OUT, GPIO_PIN_SPEED_LOW);
  SDLED_PWR_ON();
}
#endif

#if defined(IMU) && defined(IMU_I2C_BUS) && defined(IMU_I2C_BUS)
#include "drivers/lsm6ds.h"
#include "stm32_i2c_driver.h"

#define HAS_IMU

static void gyroInit()
{
  const etx_imu_t candidates[] = {
    { &imu_lsm6ds_driver, IMU_I2C_BUS, IMU_I2C_ADDRESS },
  };
  gyroStart(imuDetect(candidates, DIM(candidates)));
}
#endif

void boardInit()
{
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);

  delaysInit();
  timersInit();
  __enable_irq();

  usbInit();

#if defined(USB_CHARGE_LED) && !defined(DEBUG)
  if (usbPlugged()) {
#if defined(AUDIO_MUTE_GPIO)
     // Charging can make a buzzing noise
     gpio_init(AUDIO_MUTE_GPIO, GPIO_OUT, GPIO_PIN_SPEED_LOW);
     gpio_set(AUDIO_MUTE_GPIO);
 #endif
    while (usbPlugged()) {
      delay_ms(1000);
    }
    pwrOff();
  }
#endif

#if defined(BLUETOOTH) && !defined(PCBX9E)
  bluetoothInit(BLUETOOTH_DEFAULT_BAUDRATE, true);
#endif

#if defined(MANUFACTURER_RADIOMASTER) && defined(STM32F407xx) && !defined(RADIO_F405RGT6)
  void board_set_bor_level();
  board_set_bor_level();
#endif

  board_trainer_init();

  // Sets 'hardwareOption.pcbrev' as well
  pwrInit();
  boardInitModulePorts();

#if defined(STATUS_LEDS)
  ledInit();
#if !defined(POWER_LED_BLUE)
  ledBlue();
#else
  ledGreen();
#endif
#endif

#if defined(CSD203_SENSOR)
  IICcsd203init();
  initCSD203();
#endif

// If the radio was powered on by dual use USB, halt the boot process, let battery charge
// TODO: needs refactoring if any other manufacturer implements either of the following:
// - function switches and the radio supports charging
// - single USB for data + charge which powers on radio
#if defined(MANUFACTURER_JUMPER) && !defined(USB_CHARGE_LED)
  if (usbPlugged()) {
    adcInit(&_adc_driver);
    getADC();
    pwrOn();  // required to get bat adc reads
    INTERNAL_MODULE_OFF();
    EXTERNAL_MODULE_OFF();
    delay_ms(2000); // let this stabilize
    while (usbPlugged()) {
      //    // Let it charge ...
      getADC();  // Warning: the value read does not include VBAT calibration
      delay_ms(20);
#if defined(FUNCTION_SWITCHES)
      // Support for FS Led to indicate battery charge level
      if (getBatteryVoltage() >= 660) setFSLedON(0);
      if (getBatteryVoltage() >= 700) setFSLedON(1);
      if (getBatteryVoltage() >= 740) setFSLedON(2);
      if (getBatteryVoltage() >= 780) setFSLedON(3);
      if (getBatteryVoltage() >= 820) setFSLedON(4);
      if (getBatteryVoltage() >= 842) setFSLedON(5);
#elif defined(STATUS_LEDS)
      // Use Status LED to indicate battery charge level instead
      if (getBatteryVoltage() <= 660) ledRed();         // low discharge
      else if (getBatteryVoltage() <= 842) ledBlue();   // charging
      else ledGreen();                                  // charging done
      delay_ms(1000);
#endif
    }
    pwrOff();
  }
#endif

  keysInit();
  switchInit();

#if defined(SALED_PWR_GPIO)
  SALEDpwrInit();
#endif
#if defined(SDLED_PWR_GPIO)
  SDLEDpwrInit();
#endif

#if defined(ROTARY_ENCODER_NAVIGATION)
  rotaryEncoderInit();
#endif

  gimbalsDetect();

  if (!adcInit(&_adc_driver))
    TRACE("adcInit failed");

  lcdInit(); // delaysInit() must be called before
#if defined(RADIO_F405RGT6)
  { void f405LcdTest(); f405LcdTest(); }  // BRING-UP: LCD stripe + contrast sweep (never returns)
#endif
  audioInit();

#if defined(LED_STRIP_GPIO)
  rgbLedInit();
#endif

#if defined(HAPTIC)
  hapticInit();
#endif

#if defined(DEBUG)
  // Freeze timers & watchdog when core is halted
  DBGMCU->APB1FZ = 0x00E009FF;
  DBGMCU->APB2FZ = 0x00070003;
#endif

#if defined(PWR_BUTTON_PRESS)
  if (WAS_RESET_BY_WATCHDOG_OR_SOFTWARE()) {
    pwrOn();
  }
#endif

#if defined(TOPLCD_GPIO)
  toplcdInit();
#endif

#if defined(USB_CHARGER)
  usbChargerInit();
#endif

#if defined(RTCLOCK)
  rtcInit(); // RTC must be initialized before rambackupRestore() is called
#endif

  backlightInit();

#if defined(GUI)
  lcdSetContrast(true);
#endif

#if defined(RADIO_GX12)
  gpio_init(HALL_SYNC, GPIO_OUT, GPIO_PIN_SPEED_LOW);
#endif

#if defined(HAS_IMU)
  gyroInit();
#endif

#if defined(RADIO_F405RGT6)
  // BRING-UP DEBUG: boardInit() completed -> drive PA.07 high.
  gpio_init(GPIO_PIN(GPIOA, 7), GPIO_OUT, GPIO_PIN_SPEED_LOW);
  gpio_set(GPIO_PIN(GPIOA, 7));
#endif
}

#if defined(RADIO_F405RGT6)
// BRING-UP DEBUG: called from perMain() so a scope on PA.07 shows:
//   flat low      -> hung inside boardInit()
//   steady high   -> boardInit() done, but main loop not reached
//   square wave   -> main loop running (fully booted)
void f405DbgTick()
{
  gpio_toggle(GPIO_PIN(GPIOA, 7));
}
// BRING-UP DEBUG: edgeTxInit() progress markers.
//   stage 1 -> PC.13 high  (passed startSplash + first LCD DMA refresh)
//   stage 2 -> PC.05 high  (passed storageReadRadioSettings / SD)
void f405DbgStage(uint8_t s)
{
  if (s >= 1) { gpio_init(GPIO_PIN(GPIOC, 13), GPIO_OUT, GPIO_PIN_SPEED_LOW); gpio_set(GPIO_PIN(GPIOC, 13)); }
  if (s >= 2) { gpio_init(GPIO_PIN(GPIOC, 5),  GPIO_OUT, GPIO_PIN_SPEED_LOW); gpio_set(GPIO_PIN(GPIOC, 5)); }
}
#endif
#endif

void boardOff()
{
#if defined(LED_STRIP_GPIO) && !defined(BOOT)
  rgbLedStop();
  rgbLedClearAll();
#endif

#if defined(STATUS_LEDS) && !defined(BOOT)
  ledOff();
#endif

  BACKLIGHT_DISABLE();

#if defined(TOPLCD_GPIO) && !defined(BOOT)
  toplcdOff();
#endif

#if defined(PWR_BUTTON_PRESS)
  while (pwrPressed()) {
    WDG_RESET();
  }
#endif

#if defined(MANUFACTURER_RADIOMASTER) && defined(STM32F407xx)
  lcdInit(); 
#endif

  lcdOff();
  SysTick->CTRL = 0; // turn off systick
  pwrOff();

  // disable interrupts
  __disable_irq();

  while (1) {
    WDG_RESET();
#if defined(PWR_BUTTON_PRESS)
    // X9E/X7 needs watchdog reset because CPU is still running while
    // the power key is held pressed by the user.
    // The power key should be released by now, but we must make sure
    if (!pwrPressed()) {
      // Put the CPU into sleep to reduce the consumption,
      // it might help with the RTC reset issue
      PWR->CR |= PWR_CR_CWUF;
      /* Select STANDBY mode */
      PWR->CR |= PWR_CR_PDDS;
      /* Set SLEEPDEEP bit of Cortex System Control Register */
      SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
      /* Request Wait For Event */
      __WFE();
    }
#endif
  }

  // this function must not return!
}
